Terraform plan in __az-sandbox-env__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure-key-vault-secret.azurerm_key_vault_secret.vmpassword will be created
  + resource "azurerm_key_vault_secret" "vmpassword" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "sandbox-vmpassword"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.azure-network-interface.azurerm_network_interface.vmnic will be created
  + resource "azurerm_network_interface" "vmnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus2"
      + mac_address                   = (known after apply)
      + name                          = "sandbox-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rsg-sdb"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "niccfg-sandbox"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.azure-public-ip.azurerm_public_ip.pub_ip will be created
  + resource "azurerm_public_ip" "pub_ip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus2"
      + name                    = "pip-rsg-sdb-sandbox--001"
      + resource_group_name     = "rsg-sdb"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

  # module.azure-resource-group.azurerm_resource_group.vm-rg will be created
  + resource "azurerm_resource_group" "vm-rg" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "rsg-sdb"
    }

  # module.azure-subnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "snet-sandbox"
      + resource_group_name                            = "rsg-sdb"
      + virtual_network_name                           = "vnet-sandbox"
    }

  # module.azure-virtual-network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus2"
      + name                  = "vnet-sandbox"
      + resource_group_name   = "rsg-sdb"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

  # module.azure-windows-vm.azurerm_windows_virtual_machine.vm will be created
  + resource "azurerm_windows_virtual_machine" "vm" {
      + admin_password             = (sensitive value)
      + admin_username             = "user_01"
      + allow_extension_operations = true
      + computer_name              = (known after apply)
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + id                         = (known after apply)
      + location                   = "westus2"
      + max_bid_price              = -1
      + name                       = "sandbox-vm-01"
      + network_interface_ids      = (known after apply)
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "rsg-sdb"
      + size                       = "Standard_A1_v2"
      + virtual_machine_id         = (known after apply)
      + zone                       = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "microsoft"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

  # module.key-vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "get",
                ]
              + object_id               = "************************************"
              + secret_permissions      = [
                  + "get",
                  + "backup",
                  + "delete",
                  + "list",
                  + "purge",
                  + "recover",
                  + "restore",
                  + "set",
                ]
              + storage_permissions     = [
                  + "get",
                ]
              + tenant_id               = "************************************"
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westus2"
      + name                        = "sandbox-dc01-vm"
      + purge_protection_enabled    = false
      + resource_group_name         = "rsg-sdb"
      + sku_name                    = "standard"
      + soft_delete_enabled         = (known after apply)
      + soft_delete_retention_days  = 7
      + tenant_id                   = "************************************"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.random-password.random_password.vmpassword will be created
  + resource "random_password" "vmpassword" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Manage Sandbox Enviornment #106](https://github.com/hariom61/tf-az-iac/actions/runs/1670516375)